Project/Toir.Adaptation/src/Documents/гкс_ВводДанныхПоТрудовымРесурсам/гкс_ВводДанныхПоТрудовымРесурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7a0087-1c47-4d17-a91b-fe5d8008b7c7">
  <name>гкс_ВводДанныхПоТрудовымРесурсам</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="27294bfd-4105-4c88-9eb2-3d8f924a30b7">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="432c59d6-8210-4d3a-bd82-498bedd3de09">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e5ed7c4c-7b4d-4d98-8c88-ca4690a6cb8f">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="62612d7a-ba8c-4628-918b-c3d9bd202fcc">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="6f7f7710-1319-4339-b8b4-e58c746ea2c5">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f1b93a08-d4be-4133-ba61-d4d3874fbc59">
      <name>ВидДвижения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5ecaaf6b-3d5c-4d00-9c1c-fa0407d6a6c9">
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c0d5baa-3ad0-4ce3-b624-7ec25fefa7b1">
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="12e0eabf-0bcf-47ef-b378-4ca281bb9207">
      <name>Сотрудник</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="07028522-ad55-403b-a011-346950fcbdb1">
      <name>Должность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b2445faa-68a7-44b2-8c9f-96574d9f3c44">
      <name>ПериодПланирования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ab440c3b-dfbb-4617-9dd5-2a1c20ed17a8">
      <name>Доступно</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="47e86aa6-afae-4a24-a7db-28aa19ee94a3">
      <name>Запланировано</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/гкс_СоответствияДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="72c7b58c-2134-4ea4-a093-6a7b6bde4dde">
  <name>гкс_СоответствияДолжностейИКвалификаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="6245ad7c-d63f-4ba1-b08b-cfea682f5233">
    <name>Квалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="05b9fd1c-2f5a-4c5b-aacc-99a73f0ea883">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bcbb889-225d-4201-a516-de6ba512a5f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61c5c699-fd38-4321-ab3d-405fc46cd6b9">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Enums/гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам/гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="49045744-5d73-4204-bc55-f8fe05dc6207">
  <name>гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="15b29ea7-d642-4232-a49b-96e32915062a">
    <name>ВводДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6b091a01-ead0-4526-abb4-a29971101ffa">
    <name>Корректировка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Documents/гкс_ВводДанныхПоТрудовымРесурсам/Forms/гкс_ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаГлобальные;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтаФорма, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
	
	УстановитьВидимостьЭлементов();
	
	Если Параметры.Ключ.Пустая() Тогда // ЭтоНовый
		Объект.ВидОперации 
			= ПредопределенноеЗначение("Перечисление.гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.ВводДанных");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	Объект.Трудозатраты.Очистить();
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Трудозатраты

&НаКлиенте
Процедура ТрудозатратыПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ТрудозатратыДолжностьПриИзменении(Элемент)
	ТекущаяСтрока =	Элементы.Трудозатраты.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Организация) 
		И ЗначениеЗаполнено(ТекущаяСтрока.Подразделение) 
		И ЗначениеЗаполнено(ТекущаяСтрока.Должность) Тогда
		ТекущаяСтрока.Квалификация = КвалификацияПоДолжности(Объект.Организация, 
														ТекущаяСтрока.Подразделение, 
														ТекущаяСтрока.Должность);
	КонецЕсли; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	Корректировка = (Объект.ВидОперации 
					= Перечисления.гкс_ВидыОперацииВводДанныхПоТрудовымРесурсам.Корректировка);
	Элементы.ТрудозатратыЗапланировано.Видимость = Корректировка;
	Элементы.ТрудозатратыВидДвижения.Видимость = Корректировка;
	
КонецПроцедуры                          

&НаСервере
Функция КвалификацияПоДолжности(Организация, Подразделение, Должность)
	
	Квалификация = 
	РегистрыСведений.гкс_СоответствияДолжностейИКвалификаций.КвалификацияДолжности(Организация, Подразделение, Должность);
	
	Возврат Квалификация;
	
КонецФункции

#КонецОбласти
